import 'package:e_commerce/core/constants/appcolor.dart';
import 'package:flutter/material.dart';
import 'package:get/get.dart';

class TermsOfUse extends StatelessWidget {
  const TermsOfUse({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
        appBar: AppBar(
            title: Text("Terms of use".tr,style:  TextStyle(color: AppColor.orange),)
        ),
        body: Container(
          margin: EdgeInsets.all(15),
          child: ListView(
            children: [
              Text("مقدمة\n"),
              Text("مرحبًا بكم في [BuyBox]. يرجى قراءة شروط الاستخدام التالية بعناية قبل استخدام هذا التطبيق. باستخدام هذا التطبيق"
                  "، فإنك توافق على الالتزام بشروط الاستخدام هذه"),
              Text("\n2. التعديلات على الشروط نحن نحتفظ بالحق في تعديل أو تغيير هذه الشروط في أي وقت. ستكون مسؤولاً عن مراجعة هذه الشروط بانتظام."),
              Text("\n. الاستخدام المسموح هذا التطبيق مخصص للاستخدام الشخصي وغير التجاري فقط. يمنع نسخ أو توزيع أو نقل أو تعديل أو استخدام أي محتوى من التطبيق لأي غرض تجاري دون الحصول على إذن كتابي مسبق منا."),
              Text("\n4. الحسابات عند إنشاء حساب في تطبيقنا، يجب عليك تقديم معلومات دقيقة وكاملة. أنت مسؤول عن الحفاظ على سرية معلومات حسابك وكلمة المرور الخاصة بك."),
              Text("\n5. الخصوصية نحن نحترم خصوصيتك وملتزمون بحماية بياناتك الشخصية. لمزيد من المعلومات، يرجى مراجعة سياسة الخصوصية الخاصة بنا."),
              Text("\n6. الملكية الفكرية جميع المحتويات والمعلومات والمواد المتاحة من خلال هذا التطبيق محمية بموجب حقوق الطبع والنشر والقوانين الأخرى المتعلقة بحماية الملكية الفكرية. لا يجوز لك نسخ أو تعديل أو استخدام أي جزء من هذه المحتويات بدون إذن مسبق منا."),
              Text("\n7. إنهاء الاستخدام نحن نحتفظ بالحق في إنهاء أو تعليق وصولك إلى التطبيق في أي وقت دون إشعار مسبق إذا انتهكت أيًا من هذه الشروط."),
              Text('\n8. إخلاء المسؤولية يتم توفير هذا التطبيق "كما هو" دون أي ضمانات من أي نوع. نحن لا نتحمل أي مسؤولية عن أي أضرار قد تنتج عن استخدامك للتطبيق.'),
              Text("\n9. القانون الحاكم تخضع هذه الشروط وتفسر وفقًا لقوانين [سوريا/دمشق]."),

            ],
          ),
        ));
  }
}
